//package com.image;
//
//public class TestLength {
//    public static void main(String[] args) {
//
//        String s= "郑厂长',3,'编辑工序成功，工位由 工位62, 工位5777777777, 工位59, 缝纫车间1号, 缝纫车间2号缝纫车, 纫车间03号缝纫车间03号缝纫车间03号, 1号工位, 包装车间, 小k001, 小k002, 测试工位, 包装A-1, 包装A-2, 1号纵切机, 2号纵切机, 3号纵切机, 4号纵切机, 5号纵切机, 6号纵切机, 7号纵切机, 8号纵切机, 9号纵切机, 10号纵切机, 11号纵切机, 12号纵切机, 060501, 工位60, 615-和面, 615-面包成型, 615-烤面包, 测试工位001, 生产锤子屏幕, 生产锤子屏幕002, 生产锤子屏幕003, 生产锤子主板001, 生产锤子主板002, 生产锤子主板003, 生产锤子整机001, 生产锤子整机002, 生产锤子整机003, 注塑机001, 注塑机002, 注塑机003, 喷涂机001, 喷涂机002, 喷涂机003, 印刷机001, 印刷机002, 印刷机003, t001, t002, t003, 工位01, 1108001, work001, w1127001, w1127002, 3333, chejian-CC-CC-CC 改为 工位62, 工位5777777777, 工位59, 缝纫车间1号, 缝纫车间2号缝纫车, 纫车间03号缝纫车间03号缝纫车间03号, 1号工位, 包装车间, 小k001, 小k002, 测试工位, 包装A-1, 包装A-2, 1号纵切机, 2号纵切机, 3号纵切机, 4号纵切机, 5号纵切机, 6号纵切机, 7号纵切机, 8号纵切机, 9号纵切机, 10号纵切机, 11号纵切机, 12号纵切机, 060501, 工位60, 615-和面, 615-面包成型, 615-烤面包, 测试工位001, 生产锤子屏幕, 生产锤子屏幕002, 生产锤子屏幕003, 生产锤子主板001, 生产锤子主板002, 生产锤子主板003, 生产锤子整机001, 生产锤子整机002, 生产锤子整机003, 注塑机001, 注塑机002, 注塑机003, 喷涂机001, 喷涂机002, 喷涂机003, 印刷机001, 印刷机002, 印刷机003, t001, t002, t003, 工位01, 1108001, work001, w1127001, w1127002, 3333, chejian-CC-CC-CC";
//        System.out.println(s.length());
//    }
//}
